# StartPercentage Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewDisplayDepthCueing..::..StartPercentage Property
ViewDisplayDepthCueing Class See Also
---
The start percentage defines where depth cueing starts. Values between 0 and 100.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public int StartPercentage { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StartPercentage As Integer
	Get
```

Visual C++
---
```text
public:
property int StartPercentage {
	int get ();
}
```

# See Also
ViewDisplayDepthCueing Class
Autodesk.Revit.DB Namespace